#### SetWorksharingOptions Method

---

|  |
| --- |
| SaveAsOptions Class   See Also |

Sets Worksharing options for SaveAs.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void SetWorksharingOptions( 	WorksharingSaveAsOptions worksharingOptions ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetWorksharingOptions ( _ 	worksharingOptions As WorksharingSaveAsOptions _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetWorksharingOptions( 	WorksharingSaveAsOptions^ worksharingOptions ) ``` |

#### Parameters

worksharingOptions
:   Type:  Autodesk.Revit.DB WorksharingSaveAsOptions

    Must be    a null reference (  Nothing  in Visual Basic)  for a non-workshared model.

    Allowed to be    a null reference (  Nothing  in Visual Basic)  for a workshared model, in which case default values for WorksharingSaveAsOptions are used.

# See Also

SaveAsOptions Class

Autodesk.Revit.DB Namespace